[
  {
    "id": 1,
    "original": "千里送鹅毛",
    "originalMeaning": "礼轻情意重",
    "originalCountry": "China",
    "translation": "Sending a goose feather from a thousand miles away",
    "translationMeaning": "The gift is light but the sentiment is heavy",
    "imageUrl": "/2026-02-12_21-37-20.webp",
    "source": "From Chinese folklore. During the Tang Dynasty, a retainer of General Mian Bogao brought a white goose feather as a gift to the Emperor from thousands of miles away. When questioned about the meager gift, he explained that it represented the general's sincere heart despite its small value. The Emperor was moved by the sentiment. It metaphorically describes how a small gift, when sent from afar with sincere intentions, carries great emotional value.",
    "meaning": "This idiom teaches us about the importance of sincerity and intention over material value in gift-giving and relationships. It reminds us that what matters most is the thought and effort behind a gesture, not its monetary worth. It encourages us to value emotional connections and thoughtful gestures over expensive presents.",
    "usage": "Use this idiom when someone gives a small gift with deep sentimental value, or when acknowledging that a small gesture carries great emotional significance. For example, a handmade card from a distant friend, a small souvenir brought from a faraway trip, or a token of appreciation that may be inexpensive but heartfelt."
  },
  {
    "id": 2,
    "original": "泼出去的水",
    "originalMeaning": "收不回",
    "originalCountry": "China",
    "translation": "Spilled water",
    "translationMeaning": "Irreversible, cannot be taken back",
    "imageUrl": "/2026-02-12_21-09-11.webp",
    "source": "This idiom originates from Chinese proverbs. Once water is splashed onto the ground, it spreads and is absorbed by the earth, making it impossible to collect back. It metaphorically describes actions, decisions, or words that, once done or said, cannot be reversed or taken back.",
    "meaning": "This idiom teaches us about the permanence of our actions and the importance of thinking before acting or speaking. It reminds us that some decisions are irreversible and that we must accept the consequences of our choices. It encourages us to be thoughtful and deliberate in our words and actions, recognizing that we cannot undo the past.",
    "usage": "Use this idiom when describing something that cannot be reversed or taken back, or when warning about the irreversibility of certain actions. For example, harsh words spoken in anger that cannot be unsaid, a resignation letter submitted that cannot be withdrawn, or a decision made that has lasting consequences."
  },
  {
    "id": 3,
    "original": "水中捞月",
    "originalMeaning": "一场空",
    "originalCountry": "China",
    "translation": "Fishing for the moon in the water",
    "translationMeaning": "All in vain, futile effort",
    "imageUrl": "/2026-02-13_21-25-43.webp",
    "usage": "Use this idiom when someone is pursuing an impossible or unrealistic goal, or when describing a completely futile effort. For example, trying to recover lost time, attempting to change someone who refuses to change, or investing in a scheme that promises impossible returns.",
    "source": "This idiom originates from Chinese folklore and Buddhist scriptures. It refers to a monkey who tried to catch the reflection of the moon in the water, thinking it was real. The monkey jumped into the water and drowned trying to grab the moon, not realizing it was only an illusionary reflection. It metaphorically describes futile efforts to achieve something that is impossible or illusory.",
    "meaning": "This idiom teaches us about the futility of pursuing illusions and unrealistic goals. It reminds us to distinguish between reality and illusion, and not to waste our efforts on things that are impossible to attain. It encourages us to focus on practical, achievable goals rather than chasing mirages."
  },
  {
    "id": 4,
    "original": "猪八戒照镜子",
    "originalMeaning": "里外不是人",
    "originalCountry": "China",
    "translation": "Pig Bajie looks in the mirror",
    "translationMeaning": "Neither inside nor outside a person",
    "imageUrl": "/2026-02-12_17-13-26.webp",
    "source": "From \"Journey to the West,\" one of China's Four Great Classical Novels. Zhu Bajie (Pig Bajie), one of the main characters, is a pig demon who looks in the mirror and sees his pig face. It metaphorically describes someone who ends up offending both sides and being criticized by everyone, no matter what they do.",
    "meaning": "This idiom teaches us about the difficulty of trying to please everyone and the consequences of being caught between conflicting sides. It reminds us that when we try to accommodate everyone, we often end up satisfying no one. It encourages us to take a clear stance rather than trying to be all things to all people.",
    "usage": "Use this idiom when someone tries to mediate between two parties but ends up being criticized by both, or when someone's efforts to please everyone backfire. For example, a manager trying to satisfy both employees and upper management but being criticized by both, or a person caught between two friends' conflicts who is blamed by both."
  },
  {
    "id": 5,
    "original": "鹬蚌相争",
    "originalMeaning": "渔翁得利",
    "originalCountry": "China",
    "translation": "Sandpiper and clam, fisherman gains",
    "translationMeaning": "Third party benefits from conflict",
    "imageUrl": "/2026-02-12_14-12-23.jpg",
    "source": "From \"Strategies of the Warring States: Yan Strategy II.\" A sandpiper tried to eat a clam's meat, but the clam clamped shut on its beak. They struggled together, refusing to let go. A fisherman came by and caught them both. It metaphorically describes how two parties in conflict both lose, allowing a third party to benefit.",
    "meaning": "This idiom warns against the dangers of prolonged conflict and the wisdom of compromise. It teaches us that fighting with others often leads to mutual destruction, while those who stand aside can take advantage. It encourages seeking peaceful resolution and avoiding unnecessary conflicts.",
    "usage": "Use this idiom when two parties are in conflict and a third party benefits, or when warning against engaging in prolonged disputes. For example, two companies competing so fiercely that a third competitor takes their market share, or two siblings fighting over a toy while another child plays with it."
  },
  {
    "id": 6,
    "original": "铁杵磨成针",
    "originalMeaning": "功到自然成",
    "originalCountry": "China",
    "translation": "Grinding an iron pestle into a needle",
    "translationMeaning": "Perseverance leads to success",
    "imageUrl": "/2026-02-12_14-12-20.jpg",
    "source": "The story of Li Bai, one of China's greatest poets, meeting an old woman grinding a large iron pestle into a needle by a river. When asked why she was doing something so difficult, she replied that with enough time and patience, anything can be accomplished. This inspired Li Bai to study harder.",
    "meaning": "This idiom teaches the power of persistence and dedication. It reminds us that with enough time, patience, and consistent effort, even the most difficult goals can be achieved. It encourages us to stay committed to our goals despite obstacles and setbacks.",
    "usage": "Use this idiom when someone needs encouragement to keep working on a long-term goal, or when celebrating someone who has achieved success through persistent effort. For example, a student preparing for exams over many months, or an entrepreneur building a business from scratch."
  },
  {
    "id": 7,
    "original": "塞翁失马",
    "originalMeaning": "焉知非福",
    "originalCountry": "China",
    "translation": "Old man lost his horse",
    "translationMeaning": "A blessing in disguise",
    "imageUrl": "/2026-02-12_14-12-22.webp",
    "source": "From \"Huainanzi: Ren Jian Xun.\" An old man living near the frontier lost his horse. His neighbors sympathized, but he said, \"Who knows if this is not a blessing?\" Later, the horse returned with another fine horse. Then his son fell riding the horse and broke his leg. Again, the old man said, \"Who knows if this is not a blessing?\" When war came, all young men were drafted except his son due to his injury.",
    "meaning": "This idiom teaches the wisdom of perspective and acceptance. It reminds us that good and bad fortune are intertwined, and what appears to be misfortune may lead to good outcomes, and vice versa. It encourages maintaining a balanced attitude toward life's ups and downs.",
    "usage": "Use this idiom when something bad happens but leads to unexpected good results, or when trying to console someone who has suffered a loss. For example, losing a job but finding a better career path, or missing a train but avoiding an accident."
  },
  {
    "id": 8,
    "original": "八仙过海",
    "originalMeaning": "各显神通",
    "originalCountry": "China",
    "translation": "Eight Immortals cross the sea",
    "translationMeaning": "Each showing their special abilities",
    "imageUrl": "/2026-02-12_17-13-27.jpg",
    "source": "From Chinese mythology and folklore. The Eight Immortals (八仙) - eight legendary figures in Chinese Taoism - needed to cross the sea to attend a conference. Instead of taking a boat, each immortal used their unique magical powers and tools to cross the ocean. Some rode on lotus flowers, others used bamboo tubes, swords, or their own abilities. It metaphorically describes people using their unique skills and methods to achieve the same goal.",
    "meaning": "This idiom celebrates diversity of skills and encourages creative problem-solving. It teaches us that there are many paths to the same destination and that everyone has unique strengths they can contribute. It encourages us to value different approaches and recognize that success can be achieved through various methods.",
    "usage": "Use this idiom when a group of people all achieve the same goal but through different methods, or when encouraging people to use their unique talents. For example, team members each using their different skills to solve a problem, or different countries taking different approaches to tackle climate change."
  },
  {
    "id": 9,
    "original": "虎落平阳",
    "originalMeaning": "被犬欺",
    "originalCountry": "China",
    "translation": "Tiger in flat land",
    "translationMeaning": "Powerful in wrong place, bullied by weak",
    "imageUrl": "/2026-02-12_14-18-14.webp",
    "source": "This idiom originates from Chinese proverbs. A tiger is powerful and feared in the mountains, but when it descends to flat lands (平阳 - Pingyang, meaning flat terrain), it loses its natural advantage and can even be bullied by dogs. It metaphorically describes powerful people who, when out of their favorable environment, become vulnerable and can be oppressed by those they would normally dominate.",
    "meaning": "This idiom teaches us about the importance of environment and context in determining one's power and influence. It reminds us that strength is relative and depends on being in the right circumstances. It also serves as a warning to powerful people to be humble and recognize their vulnerability when outside their domain.",
    "usage": "Use this idiom when a powerful person is in a difficult situation where they lose their advantage and are oppressed by those they would normally dominate, or when warning against the consequences of losing one's advantageous position. For example, a CEO losing power and being mistreated by subordinates, or a military general defeated and captured by ordinary soldiers."
  },
  {
    "id": 10,
    "original": "泥菩萨过河",
    "originalMeaning": "自身难保",
    "originalCountry": "China",
    "translation": "Clay Buddha crosses the river",
    "translationMeaning": "Cannot save itself",
    "imageUrl": "/2026-02-12_14-12-27.webp",
    "source": "This idiom originates from Chinese folklore. A clay Buddha statue, made of mud and earth, when placed in water, would gradually dissolve and fall apart. It metaphorically describes someone who is in such a precarious situation that they cannot even protect themselves, let alone help others.",
    "meaning": "This idiom teaches us about self-preservation and the importance of securing one's own position before attempting to help others. It reminds us that we must first ensure our own stability and safety before we can effectively assist others. It also highlights the reality that people in vulnerable positions often lack the capacity to help others.",
    "usage": "Use this idiom when someone is in such a difficult situation that they cannot help anyone else, or when warning against relying on someone who is themselves in trouble. For example, a person struggling financially cannot lend money to others, or someone facing their own crisis cannot assist with someone else's problems."
  },
  {
    "id": 11,
    "original": "狗拿耗子",
    "originalMeaning": "多管闲事",
    "originalCountry": "China",
    "translation": "A dog trying to catch mice",
    "translationMeaning": "Too meddlesome",
    "imageUrl": "/dog.webp",
    "source": "This idiom originates from the Qing Dynasty novel \"The Story of Heroic Sons and Daughters\" (儿女英雄传) by Wen Kang, specifically chapter 34. It metaphorically describes meddling in affairs that are outside one's responsibility or expertise. Traditionally, a dog's duty is to guard the house, while catching mice is the cat's job; thus, a dog attempting to catch mice is seen as overstepping its bounds.",
    "meaning": "This idiom cautions against interfering in matters that do not concern you or are beyond your role. It highlights the importance of respecting boundaries and focusing on one's own responsibilities rather than unnecessarily involving oneself in others' affairs. It serves as a reminder that even with good intentions, meddling can be unwelcome and counterproductive.",
    "usage": "Use this idiom when someone interferes in a situation that is none of their business, or when they try to take on a task that is clearly someone else's responsibility. For example, giving unsolicited advice on a colleague's project, or getting involved in a family dispute that doesn't involve you."
  },
  {
    "id": 12,
    "original": "竹篮打水",
    "originalMeaning": "一场空",
    "originalCountry": "China",
    "translation": "Drawing water with a bamboo basket",
    "translationMeaning": "All in vain",
    "imageUrl": "/idiom-1.webp",
    "source": "This idiom originates from Chinese folklore. It metaphorically describes wasting effort with no result. It vividly illustrates the impossibility of drawing water with a bamboo basket, which cannot hold water due to its woven structure.",
    "meaning": "This idiom teaches us to recognize the futility of using wrong methods or tools for a task. It reminds us that no matter how much effort we invest, if our approach is fundamentally flawed, we will achieve nothing. It encourages practical wisdom and efficiency in our endeavors.",
    "usage": "Use this idiom when someone wastes time and effort on a project with fundamentally wrong methods, or when trying to achieve something through inappropriate means. For example, trying to solve a technical problem without understanding the basics, or attempting to grow tropical plants in a cold climate without proper facilities."
  },
  {
    "id": 13,
    "original": "肉包子打狗",
    "originalMeaning": "有去无回",
    "originalCountry": "China",
    "translation": "Hitting a dog with a meat bun",
    "translationMeaning": "Gone forever",
    "imageUrl": "/idiom-2.webp",
    "source": "This idiom comes from \"Journey to the West.\" Sun Wukong used meat buns to lure dogs while fighting demons, but the buns were eaten and never returned. It metaphorically describes something or someone given away that cannot be recovered.",
    "meaning": "This idiom warns us about irreversible decisions and actions. It highlights the importance of considering consequences before giving something away or committing to a course of action. Once something is lost or given without proper consideration, it may be impossible to retrieve.",
    "usage": "Use this idiom when describing situations where money, resources, or people are given away with no hope of return. For example, lending money to someone who has no intention or ability to repay, or investing in a venture without proper research that later turns out to be a scam."
  },
  {
    "id": 14,
    "original": "哑巴吃黄连",
    "originalMeaning": "有苦说不出",
    "originalCountry": "China",
    "translation": "A mute eating bitter herbs",
    "translationMeaning": "Suffering in silence",
    "imageUrl": "/idiom-3.webp",
    "source": "Originates from Chinese folk sayings. Coptis chinensis is an extremely bitter medicinal herb. A mute eating bitter herbs feels the pain but cannot express it. It metaphorically describes someone who suffers grievances but cannot express them.",
    "meaning": "This idiom reflects the complexity of human emotions when we are unable to express our suffering. It reminds us that sometimes pain and injustice must be endured in silence due to circumstances beyond our control. It teaches empathy for those who carry hidden burdens.",
    "usage": "Use this idiom when someone suffers injustice but cannot speak out due to fear of consequences, or when someone endures hardship silently because they have no one to turn to. For example, an employee who is mistreated by their boss but cannot complain because they need the job, or someone who is wronged but cannot prove their innocence."
  },
  {
    "id": 15,
    "original": "画蛇添足",
    "originalMeaning": "多此一举",
    "originalCountry": "China",
    "translation": "Drawing feet on a snake",
    "translationMeaning": "Gilding the lily",
    "imageUrl": "/idiom-4.webp",
    "source": "Comes from \"Strategies of the Warring States: Qi Strategy II.\" A man from Chu rewarded guests with wine after sacrificing to ancestors. The guests decided to compete in drawing snakes - the first to finish would drink the wine. One man drew quickly, picked up the wine pot to drink, then added feet to his snake. Another man finished his snake, took the wine, and said: \"Snakes have no feet; by adding feet, it is no longer a snake.\" It metaphorically describes doing something unnecessary and ruining the result.",
    "meaning": "This idiom cautions against perfectionism that becomes counterproductive. It teaches us that knowing when to stop is as important as knowing what to do. Adding unnecessary elements to something already complete can only diminish its value. It emphasizes the wisdom of restraint and simplicity.",
    "usage": "Use this idiom when someone adds unnecessary details or features that actually make things worse or more complicated. For example, adding too many special effects to a movie that distract from the story, or over-decorating a beautiful design until it becomes cluttered and loses its appeal."
  },
  {
    "id": 16,
    "original": "井底之蛙",
    "originalMeaning": "目光短浅",
    "originalCountry": "China",
    "translation": "A frog in a well",
    "translationMeaning": "Short-sighted",
    "imageUrl": "/idiom-5.webp",
    "source": "From \"Zhuangzi: Autumn Water.\" A frog living in a shallow well boasted to a giant sea turtle about how happy it was. The turtle told the frog about the vastness of the sea, and the frog was stunned. It metaphorically describes someone with narrow vision and short-sightedness.",
    "meaning": "This idiom warns against intellectual and experiential limitations. It encourages us to step outside our comfort zones and explore the vast world beyond our immediate surroundings. It reminds us that what seems complete and perfect within our limited perspective may be insignificant in the greater scheme of things.",
    "usage": "Use this idiom when someone has narrow views or limited understanding because they rarely leave their familiar environment or interact with diverse people. For example, someone who thinks their local customs are the only correct way, or someone who believes their small community's problems are the most important issues in the world."
  },
  {
    "id": 17,
    "original": "杞人忧天",
    "originalMeaning": "庸人自扰",
    "originalCountry": "China",
    "translation": "A person from Qi worrying about the sky",
    "translationMeaning": "Unnecessary anxiety",
    "imageUrl": "/idiom-6.webp",
    "source": "From \"Liezi: Tianrui.\" A person from Qi worried all day that the sky would collapse and the earth would sink, leaving him with no place to stay, so he could neither eat nor sleep. It metaphorically describes unnecessary or groundless anxiety.",
    "meaning": "This idiom satirizes irrational fears and anxiety over imagined disasters. It teaches us to distinguish between legitimate concerns and groundless worries. It reminds us that excessive worry over uncontrollable events only wastes our energy and deprives us of peace of mind.",
    "usage": "Use this idiom when someone worries excessively about extremely unlikely events or disasters. For example, someone who refuses to travel because they are convinced the plane will crash, or someone who is constantly anxious about fictional scenarios like meteor strikes or zombie outbreaks."
  },
  {
    "id": 18,
    "original": "掩耳盗铃",
    "originalMeaning": "自欺欺人",
    "originalCountry": "China",
    "translation": "Covering one's ears to steal a bell",
    "translationMeaning": "Deceiving oneself",
    "imageUrl": "/idiom-7.webp",
    "source": "From \"Lüshi Chunqiu: Self-Knowledge.\" After the Fan family of Jin was destroyed, a thief wanted to steal their bell, but feared the sound would alert others. He covered his own ears to steal it, thinking that if he could not hear it, others could not either. It metaphorically describes self-deception - trying to cover up something that cannot be hidden.",
    "meaning": "This idiom exposes the absurdity of self-deception. It reminds us that we cannot hide the truth from others by hiding it from ourselves. It teaches us to face reality honestly rather than pretending problems do not exist. Self-deception only delays necessary action and compounds our difficulties.",
    "usage": "Use this idiom when someone tries to hide obvious problems or mistakes by pretending they do not exist. For example, a student who cheats on an exam and thinks no one will notice, or someone who ignores financial problems hoping they will disappear on their own."
  },
  {
    "id": 19,
    "original": "刻舟求剑",
    "originalMeaning": "不知变通",
    "originalCountry": "China",
    "translation": "Carving a mark on a boat to find a sword",
    "translationMeaning": "Rigid thinking",
    "imageUrl": "/idiom-8.webp",
    "source": "From \"Lüshi Chunqiu: Observing the Present.\" A man from Chu was crossing the river when his sword fell into the water. He immediately carved a mark on the boat, saying: \"This is where my sword fell.\" When the boat stopped, he dove into the water from the mark to find his sword, but of course could not find it. It metaphorically describes being rigid and inflexible, unable to adapt to changing circumstances.",
    "meaning": "This idiom illustrates the danger of rigid thinking in a changing world. It teaches us that solutions must adapt to changing circumstances rather than relying on fixed patterns. It encourages flexibility and adaptability in our approach to problems, reminding us that what worked once may not work again.",
    "usage": "Use this idiom when someone stubbornly applies outdated methods to new situations, or when someone cannot adapt to changes in their environment. For example, a business that refuses to adopt new technologies while competitors modernize, or a teacher who uses the same lesson plan year after year despite changing student needs."
  },
  {
    "id": 20,
    "original": "守株待兔",
    "originalMeaning": "墨守成规",
    "originalCountry": "China",
    "translation": "Waiting by a stump for a rabbit",
    "translationMeaning": "Relying on luck and inflexibility",
    "imageUrl": "/idiom-9.webp",
    "source": "From \"Han Feizi: Five Vermin.\" A farmer from Song had a tree stump in his field. One day, a rabbit ran too fast, hit the stump, and died. The farmer got a free rabbit, so he stopped farming and guarded the stump all day waiting for rabbits to hit it. He never saw another rabbit and was mocked by the people of Song. It metaphorically describes sticking to narrow experience without flexibility, or hoping to gain without effort.",
    "meaning": "This idiom warns against the error of generalizing from rare lucky events. It teaches us that one fortunate occurrence should not become the basis for a strategy. It reminds us that success usually requires consistent effort and adaptation, not passive waiting for luck to repeat itself.",
    "usage": "Use this idiom when someone relies on a one-time lucky experience and expects it to happen again without effort. For example, someone who won money gambling once and now thinks they can make a living from it, or a student who got an easy A on one test and thinks they do not need to study for future exams."
  },
  {
    "id": 21,
    "original": "班门弄斧",
    "originalMeaning": "不自量力",
    "originalCountry": "China",
    "translation": "Showing off one's axe skills at Lu Ban's door",
    "translationMeaning": "Overestimating oneself",
    "imageUrl": "/idiom-10.webp",
    "source": "From Tang dynasty Liu Zongyuan's \"Preface to the Poems by the Wang Brothers.\" Ban refers to Lu Ban, the master carpenter of the Spring and Autumn period, revered as the ancestor of carpentry. Showing off axe skills at Lu Ban's door metaphorically describes showing off in front of an expert and overestimating oneself.",
    "meaning": "This idiom teaches humility and self-awareness. It reminds us to recognize the limits of our knowledge and skills, especially in the presence of true masters. It cautions against arrogance and encourages us to learn from those with greater expertise rather than foolishly trying to impress them.",
    "usage": "Use this idiom when someone attempts to show off their limited skills in front of experts, or when a beginner tries to teach someone who is already highly experienced. For example, an amateur cook giving advice to a professional chef, or a new employee suggesting improvements to a veteran colleague who has worked there for decades."
  },
  {
    "id": 22,
    "original": "对牛弹琴",
    "originalMeaning": "白费口舌",
    "originalCountry": "China",
    "translation": "Playing lute to a cow",
    "translationMeaning": "Wasting words on an unappreciative audience",
    "imageUrl": "/idiom-11.webp",
    "source": "From \"Mouzi Li Huo Lun\" by Mouzi of the Eastern Han dynasty. A lute player performed for cows, but the cows continued eating grass, uninterested in the music. It metaphorically describes speaking to someone who cannot understand or appreciate what is being said.",
    "meaning": "This idiom teaches us the importance of understanding our audience before communicating. It reminds us that the value of communication depends not just on what we say, but on the receiver's ability and willingness to understand. It encourages us to adapt our message and approach to suit our audience.",
    "usage": "Use this idiom when someone explains complex ideas to people who cannot understand them, or when someone's effort is wasted on an unappreciative audience. For example, a professor trying to explain advanced physics to young children, or an artist presenting their work to people with no appreciation for art."
  },
  {
    "id": 23,
    "original": "亡羊补牢",
    "originalMeaning": "为时未晚",
    "originalCountry": "China",
    "translation": "Mending the fence after sheep are lost",
    "translationMeaning": "Better late than never",
    "imageUrl": "/idiom-12.webp",
    "source": "From \"Strategies of the Warring States: Chu Strategy IV.\" After losing sheep to a wolf attack, a shepherd was advised to mend his fence. He questioned the wisdom, but was told it was not too late to prevent further losses. It metaphorically describes taking remedial action after a mistake to prevent further damage.",
    "meaning": "This idiom encourages proactive response to mistakes and setbacks. It teaches us that while we cannot undo past errors, we can always take action to prevent them from recurring. It emphasizes the value of learning from mistakes and turning failures into opportunities for improvement.",
    "usage": "Use this idiom when someone takes corrective action after a mistake, or when it's suggested that it's not too late to fix a problem. For example, a company improving security after a data breach, or a student studying harder after receiving poor grades."
  },
  {
    "id": 24,
    "original": "三个臭皮匠",
    "originalMeaning": "顶个诸葛亮",
    "originalCountry": "China",
    "translation": "Three cobblers equal one Zhuge Liang",
    "translationMeaning": "Two heads are better than one",
    "imageUrl": "/idiom-13.webp",
    "source": "A folk saying that evolved from \"three cobbler chiefs\" (top artisans). Over time, \"cobbler\" became a humble profession representing ordinary people, while Zhuge Liang, the brilliant strategist from the Three Kingdoms period, symbolized supreme wisdom. It metaphorically describes how collective wisdom of ordinary people can match or exceed that of a genius.",
    "meaning": "This idiom celebrates the power of collaboration and collective intelligence. It teaches us that even ordinary individuals, when working together and pooling their knowledge, can achieve remarkable results. It encourages teamwork, discussion, and the recognition that everyone has valuable insights to contribute.",
    "usage": "Use this idiom when a group of ordinary people solve a difficult problem through collaboration, or when teamwork achieves better results than individual effort. For example, a group of colleagues brainstorming to solve a complex technical issue, or a community working together to improve their neighborhood."
  },
  {
    "id": 25,
    "original": "老马识途",
    "originalMeaning": "经验丰富",
    "originalCountry": "China",
    "translation": "Old horses know the way",
    "translationMeaning": "Experience counts",
    "imageUrl": "/idiom-14.webp",
    "source": "From \"Han Feizi: Shuo Lin.\" Duke Huan of Qi led an army to attack Guzhu and got lost in the mountains. His minister Guan Zhong suggested following the old horses from the region. The old horses led them out of the mountains. It metaphorically describes someone with experience who can guide others through difficult situations.",
    "meaning": "This idion honors the value of experience and wisdom gained over time. It teaches us that practical knowledge cannot be replaced by theory or enthusiasm alone. It reminds us to respect and learn from those who have walked the path before us, as their experience can guide us safely through unfamiliar terrain.",
    "usage": "Use this idiom when someone with experience guides others through a difficult situation, or when experienced knowledge proves valuable. For example, a veteran employee mentoring new team members during a challenging project, or an experienced doctor diagnosing a rare disease that stumped younger colleagues."
  },
  {
    "id": 26,
    "original": "狗咬吕洞宾",
    "originalMeaning": "不识好人心",
    "originalCountry": "China",
    "translation": "A dog bites Lu Dongbin",
    "translationMeaning": "Biting the hand that feeds you",
    "imageUrl": "/idiom-15.webp",
    "source": "Based on the legend of Lu Dongbin, one of the Eight Immortals in Taoism. Known for his kindness and desire to help people become immortals, he was once bitten by a dog he was trying to save. It metaphorically describes someone who repays kindness with hostility or misinterprets good intentions.",
    "meaning": "This idiom warns against the ingratitude and misunderstanding of kindness. It teaches us that not everyone will appreciate or understand our good intentions. It reminds us that despite our best efforts to help, some people may respond negatively. It encourages patience and wisdom in choosing whom to help and how to help them.",
    "usage": "Use this idiom when someone responds with hostility to kindness, or when good intentions are misunderstood and rejected. For example, a parent trying to protect their child from harm but being yelled at, or a colleague offering helpful advice that is angrily rejected."
  },
  {
    "id": 27,
    "original": "雪中送炭",
    "originalMeaning": "及时雨",
    "originalCountry": "China",
    "translation": "Sending charcoal in snow",
    "translationMeaning": "Timely help in time of need",
    "imageUrl": "/idiom-16.webp",
    "source": "From \"Fan Wang Shi\" by Fan Zhongyan of the Song dynasty. The phrase originated from the practice of wealthy people distributing charcoal to the poor during severe winters. It metaphorically describes providing timely help when someone is in desperate need, making a crucial difference in their situation.",
    "meaning": "This idiom celebrates the virtue of timely generosity and empathy. It teaches us that the most valuable help is often provided when it is most needed. It reminds us to be aware of others' suffering and to act when our help can make the greatest impact. It encourages compassion and the courage to help even when it may be inconvenient.",
    "usage": "Use this idiom when someone provides help exactly when it is most needed, or when timely assistance makes a significant difference. For example, neighbors helping a family whose house burned down, or a teacher staying late to help a struggling student before an important exam."
  },
  {
    "id": 28,
    "original": "锦上添花",
    "originalMeaning": "好上加好",
    "originalCountry": "China",
    "translation": "Adding flowers to brocade",
    "translationMeaning": "Making something good even better",
    "imageUrl": "/idiom-17.webp",
    "source": "From Wang Anshi's poem \"Mei Hua\" of the Song dynasty. The phrase describes the beauty of adding embroidered flowers to already beautiful brocade fabric. It metaphorically describes adding something excellent to something already good, enhancing its value further.",
    "meaning": "This idiom celebrates the pursuit of excellence and continuous improvement. It teaches us that we should not rest when we achieve something good, but continue to enhance and perfect it. It reminds us that there is always room for improvement and that attention to detail can elevate quality from good to extraordinary.",
    "usage": "Use this idiom when someone adds excellent improvements to something already good, or when good things are made even better. For example, adding a beautiful garden to a well-designed house, or including excellent illustrations in an already well-written book."
  },
  {
    "id": 29,
    "original": "隔岸观火",
    "originalMeaning": "袖手旁观",
    "originalCountry": "China",
    "translation": "Watching fire from opposite bank",
    "translationMeaning": "Detached observation without getting involved",
    "imageUrl": "/idiom-18.webp",
    "source": "From \"Feng Menglong Stories.\" A man stood across the river watching a fire, making comments about how people should extinguish it without taking any action himself. It metaphorically describes someone who remains aloof from troubles or conflicts, watching without getting involved.",
    "meaning": "This idiom cautions against the indifference of detached observation. It teaches us that standing aside and watching without helping is a form of moral failure. It reminds us that we have a responsibility to help when we can, rather than being passive spectators of others' misfortunes. It encourages courage and compassion in taking action.",
    "usage": "Use this idiom when someone watches others in trouble without offering help, or when someone remains detached from problems that require involvement. For example, bystanders watching a crime without calling for help, or colleagues ignoring workplace bullying without intervening."
  },
  {
    "id": 30,
    "original": "滥竽充数",
    "originalMeaning": "冒充内行",
    "originalCountry": "China",
    "translation": "Passing off as a yu player",
    "translationMeaning": "Pretending to be competent when one is not",
    "imageUrl": "/idiom-19.webp",
    "source": "From \"Han Feizi: Internal Deposition.\" King Xuan of Qi loved yu (ancient wind instrument) music and employed 300 players to perform together. A man named Nanguo who could not play joined the group and faked playing. When the next king required solo performances, Nanguo fled. It metaphorically describes someone pretending to have skills they lack.",
    "meaning": "This idion warns against deception and the lack of genuine skill. It teaches us that pretending to be competent will eventually be exposed, especially when individual performance is required. It reminds us of the importance of developing real skills rather than relying on superficial appearances or the ability to blend into a crowd.",
    "usage": "Use this idiom when someone pretends to have knowledge or skills they do not possess, or when incompetent people are hidden among capable groups. For example, an employee who cannot do their job but survives by looking busy, or a student who cheats on assignments instead of learning."
  },
  {
    "id": 31,
    "original": "拔苗助长",
    "originalMeaning": "欲速则不达",
    "originalCountry": "China",
    "translation": "Pulling up seedlings to help them grow",
    "translationMeaning": "Haste makes waste",
    "imageUrl": "/idiom-20.webp",
    "source": "From \"Mengzi: Gongsun Chou I.\" A farmer in Song was impatient for his rice seedlings to grow taller, so he pulled them up one by one. The seedlings withered and died. It metaphorically describes forcing development or progress, which results in damage or failure.",
    "meaning": "This idiom teaches the wisdom of patience and respecting natural processes. It reminds us that growth and development cannot be rushed without causing harm. It cautions against impatience and the desire for immediate results at the expense of long-term success. It encourages us to trust in natural timing and sustainable development.",
    "usage": "Use this idiom when someone tries to rush development or growth, resulting in damage. For example, parents forcing children into advanced education before they are ready, or a business expanding too quickly without building a solid foundation, leading to collapse."
  },
  {
    "id": 32,
    "original": "秀才遇到兵",
    "originalMeaning": "有理讲不清",
    "originalCountry": "China",
    "translation": "Scholar meets soldier",
    "translationMeaning": "Cannot reason with unreasonable people",
    "imageUrl": "/2026-02-12_21-09-14.jpg",
    "source": "This idiom originates from traditional Chinese culture. A xiucai (scholar who passed the imperial examination) represents intellect, logic, and civilized discourse, while a soldier represents brute force and authority. When a scholar tries to reason with a soldier who only responds to orders or force, his logical arguments have no effect. It metaphorically describes the frustration of trying to use reason with someone who doesn't value it or operates by different rules.",
    "meaning": "This idiom teaches us about the futility of trying to reason with those who don't value logic or intellectual discourse. It reminds us that different people operate by different value systems, and sometimes logic simply won't work. It encourages us to recognize when communication styles are incompatible and adapt our approach accordingly, rather than wasting effort on futile reasoning.",
    "usage": "Use this idiom when someone tries to use logic and reason with someone who responds only with force or refuses to listen, or when describing the frustration of dealing with unreasonable people. For example, trying to explain technical details to a manager who only cares about results, or trying to reason with an angry customer who refuses to listen."
  },
  {
    "id": 33,
    "original": "小葱拌豆腐",
    "originalMeaning": "一清二白",
    "originalCountry": "China",
    "translation": "Scallion and tofu salad",
    "translationMeaning": "Perfectly clear and white",
    "imageUrl": "/2026-02-14_12-34-54.webp",
    "source": "This idiom originates from Chinese cuisine and folk culture. A simple dish made of mixing fresh green scallions with white tofu creates a visually pleasing contrast of green and white. The idiom metaphorically describes a person or situation that is completely honest, transparent, and innocent, without any hidden motives or corruption.",
    "meaning": "This idiom celebrates honesty, transparency, and moral integrity. It teaches us the value of being open and straightforward in our dealings with others. It reminds us that simplicity and honesty are virtues that should be cherished, and that a clear conscience brings peace of mind.",
    "usage": "Use this idiom when praising someone for their honesty and transparency, or when describing a situation that is completely clear and aboveboard. For example, a government official known for their integrity, a business deal conducted with complete transparency, or someone who admits their mistakes openly."
  },
  {
    "id": 34,
    "original": "芝麻开花",
    "originalMeaning": "节节高",
    "originalCountry": "China",
    "translation": "Sesame flowers blooming",
    "translationMeaning": "Rising step by step",
    "imageUrl": "/2026-02-14_12-34-55.webp",
    "source": "This idiom originates from Chinese agriculture and folk observations. The sesame plant has a unique characteristic: as it grows, its flowers bloom from the bottom upward, with each segment producing flowers higher than the previous one. This visual metaphor describes steady progress and continuous improvement over time.",
    "meaning": "This idiom celebrates progress, growth, and steady advancement. It teaches us that success comes from continuous effort and that each step forward builds upon the previous one. It encourages perseverance and recognizes that steady, consistent progress leads to great achievements.",
    "usage": "Use this idiom when describing someone's career or life progress, or when wishing someone continued success and advancement. For example, a student getting better grades each semester, an employee receiving regular promotions, or a business steadily growing over the years."
  },
  {
    "id": 35,
    "original": "骑驴看唱本",
    "originalMeaning": "走着瞧",
    "translation": "Reading a libretto while riding a donkey",
    "translationMeaning": "Wait and see / Let's see how things turn out",
    "imageUrl": "/2026-02-15_10-54-38.jpg",
    "source": "This idiom originates from Chinese folk sayings. In ancient times, people would ride donkeys while reading opera scripts or storybooks as they traveled. The phrase '走着瞧' literally means 'look while walking' - you're going to see what happens as you proceed on your journey. It metaphorically describes a situation where one should wait and see the outcome rather than jumping to conclusions.",
    "meaning": "This idiom teaches us about patience and the importance of letting events unfold naturally. It reminds us that making premature judgments can be unwise, and that the truth will reveal itself over time. It encourages a calm, confident attitude when facing uncertainty, knowing that the outcome will become clear eventually.",
    "usage": "Use this idiom when expressing confidence that time will prove who is right, or when telling someone to wait and see the results rather than arguing. For example, when someone doubts your abilities, you might say this to express that your results will speak for themselves, or when the outcome of a situation is uncertain.",
    "imgPrompt": "A serene traditional Chinese watercolor scene blended with modern minimalism. A figure in simple historical attire rides a gentle donkey on a winding path, calmly reading an open booklet (libretto). The path extends into the distance, symbolizing the journey and the future. Subtle ink-wash strokes and faint bamboo silhouettes grace the background. The composition is balanced with ample negative space, using warm, harmonious tones like muted earth browns, soft greens, and gentle blues. The overall aesthetic evokes patience, observation, and cultural elegance, suitable for a clean card layout with text overlay. High-quality, detailed, artistic, professional illustration, 1:1 ratio.",
    "originalCountry": "China"
  },
  {
    "id": 36,
    "original": "王婆卖瓜",
    "originalMeaning": "自卖自夸",
    "translation": "Wang Po selling melons",
    "translationMeaning": "Praising one's own goods",
    "imageUrl": "/2026-02-15_11-19-10.jpg",
    "source": "From Chinese folklore and traditional storytelling. Wang Po (王婆), a legendary figure, was known for enthusiastically praising and advertising her own melons in the market. She would loudly proclaim how sweet and delicious her melons were, regardless of their actual quality. It metaphorically describes someone who shamelessly promotes themselves or their own work, often exaggerating its merits.",
    "meaning": "This idiom teaches us about the nature of self-promotion and the importance of humility. It reminds us that excessive self-praise can appear boastful and may lead others to question the actual quality of what is being promoted. It encourages us to let our work speak for itself and to be modest about our achievements, while also acknowledging that some degree of self-promotion is necessary in certain contexts.",
    "usage": "Use this idiom when someone is excessively praising themselves or their own work, or when describing a situation of shameless self-promotion. For example, a job applicant exaggerating their qualifications, a company promoting its products with exaggerated claims, or someone bragging about their own achievements.",
    "imgPrompt": "A stylized illustration blending traditional Chinese watercolor and modern minimalism. On one side, depict a cheerful, stylized old woman (Wang Po) in simple historical clothing, proudly presenting a pile of ripe, glossy melons at a market stall. On the other side, use visual metaphors for self-praise: perhaps an exaggerated speech bubble containing shining melon icons, or the woman's reflection in a melon appearing boastful. Use warm, harmonious colors like melon-green, soft orange, and earthy tones. Incorporate subtle cultural elements like faint bamboo silhouettes or ink wash textures in the background. The composition is clean, balanced with ample negative space, suitable for a card layout. The style is artistic, detailed, and professional, with a 1:1 aspect ratio.",
    "originalCountry": "China"
  },
  {
    "id": 37,
    "original": "新官上任",
    "originalMeaning": "三把火",
    "translation": "New official takes office",
    "translationMeaning": "Three fires of enthusiasm",
    "imageUrl": "/2026-02-15_11-33-04.jpg",
    "source": "This idiom originates from ancient Chinese bureaucracy. When a new official took office, they would often start by implementing bold reforms and decisive actions to establish their authority and demonstrate their competence. The 'three fires' represent these initial energetic efforts. It metaphorically describes the enthusiasm and bold initiatives that new leaders often bring when they first assume their positions.",
    "meaning": "This idiom teaches us about the psychology of new leadership and the importance of making a strong first impression. It reminds us that new leaders often bring fresh energy and ideas, but also that this initial enthusiasm may fade over time. It encourages new leaders to make meaningful changes while being aware that sustained effort is needed for long-term success.",
    "usage": "Use this idiom when describing a new leader making bold changes in their first days, or when predicting that someone's initial enthusiasm may not last. For example, a new manager implementing sweeping policy changes, a new CEO announcing ambitious initiatives, or a new teacher starting with strict rules that might later relax.",
    "imgPrompt": "A stylized illustration blending traditional Chinese watercolor and modern minimalism. On one side, depict a cheerful, stylized old woman (Wang Po) in simple historical clothing, proudly presenting a pile of ripe, glossy melons at a market stall. On the other side, use visual metaphors for self-praise: perhaps an exaggerated speech bubble containing shining melon icons, or the woman's reflection in a melon appearing boastful. Use warm, harmonious colors like melon-green, soft orange, and earthy tones. Incorporate subtle cultural elements like faint bamboo silhouettes or ink wash textures in the background. The composition is clean, balanced with ample negative space, suitable for a card layout. The style is artistic, detailed, and professional, with a 1:1 aspect ratio.",
    "originalCountry": "China"
  },
  {
    "id": 38,
    "original": "癞蛤蟆想吃天鹅肉",
    "originalMeaning": "痴心妄想",
    "translation": "A toad lusting after a swan's flesh",
    "translationMeaning": "Wishful thinking; an impossible dream",
    "imageUrl": "/2026-02-15_17-35-22.webp",
    "source": "This proverb originates from ancient Chinese folklore and literature, reflecting a common observation in nature. The toad, often considered lowly and unattractive in traditional Chinese culture, is contrasted with the swan, a symbol of purity, beauty, and nobility. The phrase vividly captures the absurdity of an impossible desire. It has been used in classic novels, such as 'Dream of the Red Chamber,' to describe characters harboring unrealistic ambitions beyond their social station or capabilities. The imagery is straightforward yet powerful, making it a enduring metaphor in Chinese language.",
    "meaning": "This idiom describes someone who has unrealistic or wildly ambitious dreams that are completely out of reach. It criticizes foolish overconfidence or desire for something one is utterly unqualified or unsuited to obtain. The core idea is about the futility and absurdity of chasing impossible goals, emphasizing a mismatch between desire and reality.",
    "usage": "Use this phrase to humorously or critically point out that someone's goal or wish is utterly impractical and bound to fail. It carries a tone of mild mockery or gentle admonishment, often applied in casual conversations about unrealistic ambitions in career, love, or personal achievements. It's suitable among friends, in storytelling, or in instructive contexts to highlight a lesson about knowing one's limits.",
    "imgPositivePrompt": "中国传统水彩画风格，融合现代极简设计，一只癞蛤蟆蹲在池塘边的石头上，仰头望向天空中优雅飞翔的白天鹅，眼神充满渴望但显得滑稽，画面构图简洁平衡，大量留白，色调温暖和谐，采用柔和的赭石、青绿与淡雅白色，艺术化呈现，细节精致，具有寓言感和中国文化审美意境，1:1比例，高质量专业插图",
    "imgNegativePrompt": "文字，丑陋，恐怖，血腥，混乱，暗黑风格，西方油画，照片写实，复杂背景，拥挤构图，冷色调，现代科技元素，卡通动画，人物特写，低质量，模糊，水印，logo，边框",
    "originalCountry": "China"
  },
  {
    "id": 39,
    "original": "十五个吊桶打水",
    "originalMeaning": "七上八下",
    "translation": "Fifteen buckets drawing water from a well",
    "translationMeaning": "Seven up, eight down (in a state of anxiety or unease)",
    "imageUrl": "/2026-02-15_17-58-42.jpg",
    "source": "This idiom originates from Chinese folk sayings. When using buckets to draw water from a well, some buckets go up while others go down. With fifteen buckets, seven would be ascending while eight would be descending. This creates a visual representation of an unsettled, chaotic state. It metaphorically describes a person's inner turmoil, anxiety, or restlessness.",
    "meaning": "This idiom teaches us about the nature of anxiety and inner conflict. It reminds us that our emotions can sometimes feel chaotic and unsettled, like buckets moving in different directions. It encourages us to recognize these feelings and find ways to calm our minds and regain balance in our lives.",
    "usage": "Use this idiom when describing a state of nervousness, anxiety, or inner turmoil. For example, waiting for important exam results, before a job interview, when facing uncertainty about the future, or when feeling conflicted about a difficult decision.",
    "imgPositivePrompt": "中国传统水彩画与现代极简主义风格结合，描绘一口古井，井绳上悬挂着多个（约十五个）样式古朴的木制水桶，正在打水，部分水桶在上行，部分在下行，形成“七上八下”的错落动态。画面构图简洁平衡，大量留白，焦点集中在井口与桶的动态上。色调采用温暖宜人的赭石、浅褐与青蓝色调，笔触带有水彩的晕染感。整体氛围宁静中带着一丝不安的动感，艺术化地诠释“心神不宁”的隐喻。高质量，细致，专业插图。",
    "imgNegativePrompt": "文字，字母，数字，水印，签名，丑陋，畸形，扭曲的人脸或人体，现代服装，高楼大厦，汽车，照片写实，超现实主义，暗黑风格，血腥，暴力，复杂混乱的背景，过多细节，色彩刺眼不和谐，画面拥挤。",
    "originalCountry": "China"
  },
  {
    "id": 40,
    "original": "老鼠过街",
    "originalMeaning": "人人喊打",
    "translation": "A rat running across the street",
    "translationMeaning": "Everyone shouts, 'Beat it!'",
    "imageUrl": "/2026-02-16_15-38-36.webp",
    "source": "This saying is a widely circulated folk proverb in China, vividly depicting a common social phenomenon and reflecting a collective attitude towards despised or harmful elements.",
    "meaning": "It describes a person or thing that is universally disliked, condemned, or attacked by the public, much like how people instinctively want to chase away a rat seen in the open.",
    "usage": "Used to describe someone who has committed wrongs and is now facing widespread public anger, scorn, or opposition. It carries a strong negative connotation and is often applied in contexts of social criticism or moral judgment.",
    "imgPositivePrompt": "中国传统水彩画风格，结合现代极简设计，一只老鼠惊慌地跑过空旷的街道，街道两旁有简化的中式建筑轮廓，远处有模糊的人影做出驱赶或投掷的动作，画面主体突出老鼠的仓皇，整体色调温暖和谐，如赭石、淡黄与灰蓝，构图平衡，大量留白，画面整洁，艺术化且细节精致，适合作为卡片背景。",
    "imgNegativePrompt": "文字，印章，丑陋，畸形，恐怖，血腥，暴力，现代武器，汽车，过多细节，杂乱背景，拥挤画面，阴暗色调，卡通风格，照片写实，3D渲染，西方建筑，不和谐元素。",
    "originalCountry": "China"
  }
]